Revit 2026 API

# FieldDomainPoints Class

---

Abstract base class for various classes of field domain points

SystemObject Autodesk.Revit.DB.AnalysisFieldDomainPoints Autodesk.Revit.DB.AnalysisFieldDomainPointsByParameter Autodesk.Revit.DB.AnalysisFieldDomainPointsByUV Autodesk.Revit.DB.AnalysisFieldDomainPointsByXYZ

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FieldDomainPoints : IDisposable
```
```vb
Public Class FieldDomainPoints
	Implements IDisposable
```
```cpp
public ref class FieldDomainPoints : IDisposable
```
```fsharp
type FieldDomainPoints =
    class
        interface IDisposable
    end
```

The FieldDomainPoints type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FieldDomainPoints |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Analysis Namespace